zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F81xxx/MC56F81768/drivers/fsl_clock.h
/*
 * Copyright 2020-2023 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_CLOCK_H_
#define _FSL_CLOCK_H_

#include "fsl_common.h"

/*******************************************************************************
 * Introduction of peripheral and driver
 ******************************************************************************/
/*!
 *@defgroup clock Clock Driver
 *@details
 *
 * The clock module is used to help software to configure the MCU OCCS and relevant field in SIM module,
 * to provide proper clock to MCU core and its peripherals.
 *
 * @{
 */

/*******************************************************************************
 * Driver Change Log
 ******************************************************************************/
/*!
 * @defgroup clock_driver_log Driver Change Log
 * @ingroup clock
 * @{
 * Current CLOCK driver version is 2.2.0
 *
 * - 2.2.0
 *   - Update to support silicon revision 1
 *
 * - 2.1.0
 *   - Accumulated bug fix
 *   - MISRA warning fix
 *
 * - 2.0.0
 *   - Initial version.
 * @}
 */

/*******************************************************************************
 * Configurations
 ******************************************************************************/

/*! @brief Configure whether driver controls clock
 *
 * When set to 0, peripheral drivers will enable clock in initialize function
 * and disable clock in de-initialize function. When set to 1, peripheral
 * driver will not control the clock, application could control the clock out of
 * the driver.
 *
 * @note All drivers share this feature switcher. If it is set to 1, application
 * should handle clock enable and disable for all drivers.
 */
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL))
#define FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL 0
#endif

/*! @name Driver version */
/*@{*/
/*! @brief CLOCK driver version 2.2.0. */
#define FSL_CLOCK_DRIVER_VERSION (MAKE_VERSION(2, 2, 0))
/*@}*/

/*! Definition for delay API in clock driver, users can redefine it. */
#ifndef SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY
#define SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY (100000000UL)
#endif

/*! @brief List of IP clock name. */
typedef enum _clock_ip_name
{
    /* SIM_PCE0 */
    kCLOCK_GPIOF = 1U,  /*!< GPIOF clock */
    kCLOCK_GPIOE = 2U,  /*!< GPIOE clock */
    kCLOCK_GPIOD = 3U,  /*!< GPIOD clock */
    kCLOCK_GPIOC = 4U,  /*!< GPIOC clock */
    kCLOCK_GPIOB = 5U,  /*!< GPIOB clock */
    kCLOCK_GPIOA = 6U,  /*!< GPIOA clock */
    kCLOCK_TA3   = 12U, /*!< Timer A3 clock */
    kCLOCK_TA2   = 13U, /*!< Timer A2 clock */
    kCLOCK_TA1   = 14U, /*!< Timer A1 clock */
    kCLOCK_TA0   = 15U, /*!< Timer A0 clock */

    /* SIM_PCE1 */
    kCLOCK_LPI2C0 = 16U + 5U,  /*!< LPI2C0 clock */
    kCLOCK_LPI2C1 = 16U + 6U,  /*!< LPI2C1 clock */
    kCLOCK_QSPI0  = 16U + 9U,  /*!< QSPI0 clock */
    kCLOCK_QSCI1  = 16U + 11U, /*!< QSCI1 clock */
    kCLOCK_QSCI0  = 16U + 12U, /*!< QSCI0 clock */
    kCLOCK_DAC    = 16U + 13U, /*!< DAC clock */

    /* SIM_PCE2 */
    kCLOCK_PIT1   = 32U + 2U,  /*!< PIT 1 clock */
    kCLOCK_PIT0   = 32U + 3U,  /*!< PIT 0 clock */
    kCLOCK_QDC    = 32U + 4U,  /*!< QDC clock */
    kCLOCK_CRC    = 32U + 5U,  /*!< CRC clock */
    kCLOCK_CYCADC = 32U + 7U,  /*!< Cyclic ADC clock */
    kCLOCK_CMPD   = 32U + 9U,  /*!< Comparator D clock */
    kCLOCK_CMPC   = 32U + 10U, /*!< Comparator C clock */
    kCLOCK_CMPB   = 32U + 11U, /*!< Comparator B clock */
    kCLOCK_CMPA   = 32U + 12U, /*!< Comparator A clock */

    /* SIM_PCE3 */
    kCLOCK_PWMACH3 = 48U + 4U,  /*!< Enhanced Flexible PWM A3 clock */
    kCLOCK_PWMACH2 = 48U + 5U,  /*!< Enhanced Flexible PWM A2 clock */
    kCLOCK_PWMACH1 = 48U + 6U,  /*!< Enhanced Flexible PWM A1 clock */
    kCLOCK_PWMACH0 = 48U + 7U,  /*!< Enhanced Flexible PWM A0 clock */
    kCLOCK_ROM     = 48U + 9U,  /*!< ROM clock */
    kCLOCK_OPAMPB  = 48U + 10U, /*!< OPAMP B clock */
    kCLOCK_OPAMPA  = 48U + 11U, /*!< OPAMP A clock */

    /* total number of IP clock */
    kCLOCK_NOGATE = 61U, /*!< Peripheral without clock gate control */
    kCLOCK_EDMA   = kCLOCK_NOGATE,
    kCLOCK_EWM    = kCLOCK_NOGATE,
    kCLOCK_XBARA  = kCLOCK_NOGATE,
    kCLOCK_NUM    = 62U /*!< Total IP clock number */
} clock_ip_name_t;

/*! @brief List of system-level clock name. */
typedef enum _clock_name
{
    /*----------------------------- System layer clock -------------------------------*/
    kCLOCK_Mstr2xClk = 0, /*!< Master 2x clock which feed to core and peripheral */
    kCLOCK_SysClk    = 1, /*!< MCU system/core clock */
    kCLOCK_BusClk    = 2, /*!< Bus clock */
    kCLOCK_Bus2xClk  = 3, /*!< Bus 2x clock */
    kCLOCK_FlashClk  = 4, /*!< Flash clock */

    /*---------------------------------- OSC clock -----------------------------------*/
    kCLOCK_FastIrcClk    = 10, /*!< Fast internal RC oscillator, 8M/2M */
    kCLOCK_SlowIrcClk    = 11, /*!< Slow internal RC oscillator, 200K */
    kCLOCK_CrystalOscClk = 12, /*!< Crystal oscillator */

    /*----------------------------- Select/setting clock------------------------------*/
    kCLOCK_ExtClk     = 20, /*!< The selected external clock, it could be crystal oscillator, clkin0, clkin1 */
    kCLOCK_MstrOscClk = 21, /*!< The selected master oscillator clock */
    kCLOCK_PllDiv2Clk = 22  /*!< PLL output divide 2 */
} clock_name_t;

/*! @brief Crystal oscillator mode. */
typedef enum _clock_crystal_osc_mode
{
    kCLOCK_CrystalOscModeFSP = 0, /*!< Full swing pierce, high power mode */
    kCLOCK_CrystalOscModeLCP = 1  /*!< Loop controlled pierce, low power mode */
} clock_crystal_osc_mode_t;

/*! @brief List of external clock source. */
typedef enum _clock_ext_clk_src
{
    kCLOCK_ExtClkSrcCrystalOsc = 0, /*!< External clock source is crystal oscillator */
    kCLOCK_ExtClkSrcClkin      = 1  /*!< External clock source is clock in  */
} clock_ext_clk_src_t;

/*! @brief List of clock-in source. */
typedef enum _clock_ext_clkin_sel
{
    kCLOCK_SelClkIn0 = 0, /*!< Clock in 0 is selected as CLKIN */
    kCLOCK_SelClkIn1 = 1  /*!< Clock in 1 is selected as CLKIN */
} clock_ext_clkin_sel_t;

/*! @brief List of master oscillator source. */
typedef enum _clock_mstr_osc_clk_src
{
    kCLOCK_MstrOscClkSrcFirc = 0U, /*!< 8M/2M, fast internal RC oscillator */
    kCLOCK_MstrOscClkSrcExt  = 1U, /*!< External clock */
    kCLOCK_MstrOscClkSrcSirc = 2U  /*!< 200K, slow internal RC oscillator */
} clock_mstr_osc_clk_src_t;

